MOVE SPACES TO WS-OUTPUT-RECORD.

IF WS-INPUT-FIELD = 0 THEN
    MOVE "ZERO" TO WS-OUTPUT-FIELD
ELSE
    COMPUTE WS-OUTPUT-FIELD = 1 / WS-INPUT-FIELD
END-IF.

WRITE WS-OUTPUT-RECORD.